Revit 2027 API
OverrideGraphicSettings.SetSurfaceForegroundPatternVisible Method
 Sets the visibility of the surface foreground fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetSurfaceForegroundPatternVisible(
	bool fillPatternVisible
)
Public Function SetSurfaceForegroundPatternVisible (
	fillPatternVisible As Boolean
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetSurfaceForegroundPatternVisible(
	bool fillPatternVisible
)
member SetSurfaceForegroundPatternVisible :
        fillPatternVisible : bool -> OverrideGraphicSettings
Parameters
fillPatternVisible Boolean
 Value of the visibility of the surface foreground fill pattern.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace